### JOINING AND MERGING

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [10]:
names = pd. DataFrame({
'id':[1 , 2 , 3 , 4 , 5 ],
'name':['Bavitha', 'Sethu','Soorya',
'Parvathy','Ranju'],
})
ages= pd.DataFrame({
'id':[1, 2, 3, 4, 5],
'age':[20, 30, 40, 50, 60 ]
})

###### Now when we have two seperate data frames which are related to one  another, we can combine them into one data frame. It is important that we have a common column that we can merge on. In this case, this is id.

In [11]:
df=pd.merge(names,ages,on = 'id')
df.set_index('id',inplace=True)

In [12]:
df

        name  age
id
1    Bavitha   20
2      Sethu   30
3     Soorya   40
4   Parvathy   50
5      Ranju   60

#### JOINS

###### It is not necessarily always obvious how we want to merge our data frames. This where joins come into play. We have four  types of joins.

###### Now let's change our two data frames a little bit.

In [14]:
names = pd. DataFrame({
'id':[1 , 2 , 3 , 4 , 5 , 6 ],
'name':['Bavitha', 'Sethu','Soorya',
'Parvathy','Ranju' , 'Devu' ],
})
ages= pd.DataFrame({
'id':[1, 2, 3, 4, 5, 6 ],
'age':[20, 30, 40, 50, 60 , 70 ]
})

###### Our names frame now has an additional index  6 and an additional name. And our ages frame has an additional index 7 with an additional name.

In [15]:
df = pd.merge(names,ages,on = 'id' , how = 'inner' )
df.set_index('id' , inplace= True)

In [16]:
df

        name  age
id
1    Bavitha   20
2      Sethu   30
3     Soorya   40
4   Parvathy   50
5      Ranju   60
6       Devu   70

#

###### If we now perform the default inner join, we will the same data frame as in the beginning. We only take the keys which both objects have. This means one to five.

In [17]:
df = pd.merge(names,ages,on = 'id', how = 'left')
df.set_index('id', inplace= True)

In [18]:
df

        name  age
id
1    Bavitha   20
2      Sethu   30
3     Soorya   40
4   Parvathy   50
5      Ranju   60
6       Devu   70

###### When we use the left join, we get all the keys from the names data frame but not the additional index 7 from ages. This also means that flona won't assigned any age. The same principle goes for the right join the just the other way around.

In [19]:
df = pd.merge(names,ages,on = 'id', how = 'right')
df.set_index('id' , inplace=True)
df

        name  age
id
1    Bavitha   20
2      Sethu   30
3     Soorya   40
4   Parvathy   50
5      Ranju   60
6       Devu   70

###### Now, we only have the keys from the ages frame and the 6 is missing , Finally, if we use the outer join, we combine all keys into one data frame.

In [21]:
df = pd.merge(names,ages, on = 'id' , how = 'outer')
df.set_index('id' , inplace=True)
df

        name  age
id
1    Bavitha   20
2      Sethu   30
3     Soorya   40
4   Parvathy   50
5      Ranju   60
6       Devu   70